Revit 2024 API
ReferenceWithContext Members
The ReferenceWithContext type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ReferenceWithContext
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetInstanceTransform
 Gets the transform of the instance.
GetReference
 Gets the reference of the geometric object.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Proximity
 The proximity value to the ray's origin when the reference is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ).
See Also
ReferenceWithContext Class
Autodesk.Revit.DB Namespace